package Chap07_Object;

//01 상속
/*
 * 기존의 클래스를 재사용하여 새로운 클래스를 작성하는 것이다.
 * 상속을 통해서 클래스를 작성하면 보다 적은 양의 코드로 새로운 클래스를 작성할 수 있고
 * 코드를 공통적으로 관리할 수 있기 때문에 코드의 추가 및 변경이 매우 용이하다.
 * => 코드의 재사용성을 높이고 중복을 제거하여 프로그램의 생상성과 유지보수에 크게 기여한다.
 * 
 * <자바에서 상속을 구현하는 방법>
 * : 새로 작성하고자 하는 클래스의 이름 뒤에 상속받고자 하는 클래스릐 이름을
 *   키워드 'extends'와 함께 써주기만 하면 된다.
 *   
 * 		class Parent{ }
 *		class Child extends Parent{ }
 *
 * <상속 관계(조상 클래스-자손 클래스)>
 * 조상 클래스: 상속해주는 클래스
 * 자손 클래스: 상속받는 클래스
 * 
 * 자손 클래스는 조상 클래스의 모든 멤버를 상속받는다.
 */
public class Part01_inheritance {

}
