package Chap06_Object;
/*
  
 16 메서드의 구현부
  
 메서드의 선언부 다음에 오는 괄호{}를 '메서드의 구현부'하고 한다.
 여기에 메서드를 호출했을 때 수행될 문장들을 넣는다.
 
 <return문>
 
 메서드의 반환타입이 'void'가 아닌 경우, 구현부{} 안에 'return 반환값;'이 반드시 포함돼야 한다.
 이 문장은 작업을 수행한 결과인 반환값을 호출한 메서드로 전달하는데,
 이 값의 타입은 반환타입과 일치하거나 적어도 자동 형변환이 가능한 것이어야 한다.
 변수의 타입과 메서드의 반환타입은 일치해야 한다.
 
 여러 개의 변수를 선언할 수 있는 매개변수와 달리 return문은 단 하나의 값만 반환할 수 있다.
 메서드로의 입력(매개변수)은 여러 개일 수 있어도 출력(반환값)은 최대 하나만 허용하는 것이다.
 
 
 <지역변수(local variable)>
 
 메서드 내에 선언된 변수들은 그 메서드 내에서만 사용할 수 있으므로
 서로 다른 메서드라면 같은 이름의 변수를 선언해도 된다.
 이처럼 메서드 내에 선언된 변수를 '지역변수(local variable)'라고 한다.
 매개변수도 메서드 내에 선언된 것으로 간주되므로 지역변수이다.
 
 
 
 */
public class Java016_method {

}
