package Chap06_Object;
/*
 
 14 메서드란?
 
 <메서드(method)>
 특정 작업을 수행하는 일련의 문장들을 하나로 묶은 것으로,
 기본적으로 수학의 함수와 유사하다.
 어떤 값을 입력하면 이 값으로 작업을 수행해서 결과를 반환한다.
 
 수학의 함수와 달리 메서드는 입력값 또는 출력값(결과값)이 없을 수도 있으며,
 심지어는 입력값과 출력값이 모두 없을 수도 있다.
 
 메서드가 작업을 수행하는 데 필요한 값만 넣고 원하는 결과를 얻으면 될 뿐,
 메서드 내부에서 어떤 과정을 거쳐 결과를 만들어내는지 알 필요는 없다.
 즉, 메서드에 넣을 값(입력)과 반환하는 결과(출력)만 알면 되는 것이다.
 그래서 메서드를 내부가 보이지 않는 '블랙박스'라고도 한다.
 
 <메서드 정의 방식>	
 반환타입 메서드이름 (타입 변수명, 타입 변수명, ... )			 -> 선언부
 {
 		//메서드 호출시 수행될 코드				    	 -> 구현부
 }
 
 int add(int a, int b) 								-> 선언부
 {
 		int result = a + b;
 		return result; // 호출한 메서드로 결과를 반환한다	-> 구현부
 }
 
 */
public class Java014_method {

}
